import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-faq',
  imports: [CommonModule],
  templateUrl: './faq.html',
  styleUrl: './faq.scss',
})
export class Faq {
 faqs = [
  {
    question: 'কোর্সটি কি সম্পূর্ণ অনলাইন?',
    answer: 'হ্যাঁ, কোর্সটি সম্পূর্ণ অনলাইন। আপনি যেকোনো সময় এবং যেকোনো স্থান থেকে ক্লাস করতে পারবেন।'
  },
  {
    question: 'কোর্সে কতদিনের অ্যাক্সেস পাব?',
    answer: 'একবার ভর্তি হলে নির্দিষ্ট সময় অথবা লাইফটাইম অ্যাক্সেস (কোর্স নীতিমালা অনুযায়ী) পাবেন।'
  },
  {
    question: 'কোর্স শেষে কি সার্টিফিকেট দেওয়া হবে?',
    answer: 'হ্যাঁ, সফলভাবে কোর্স সম্পন্ন করলে ডিজিটাল সার্টিফিকেট প্রদান করা হবে।'
  },
  {
    question: 'আমি কি মোবাইল ফোন দিয়ে কোর্স করতে পারব?',
    answer: 'হ্যাঁ, মোবাইল, ট্যাবলেট এবং কম্পিউটার—সব ডিভাইস থেকেই কোর্স করা যাবে।'
  },
  {
    question: 'কোর্স চলাকালীন সাপোর্ট পাব কি?',
    answer: 'হ্যাঁ, নির্ধারিত সাপোর্ট গ্রুপ এবং ইনস্ট্রাক্টর সাপোর্ট প্রদান করা হবে।'
  },
  {
    question: 'পেমেন্ট করার পর কী করতে হবে?',
    answer: 'পেমেন্ট সম্পন্ন করার পর স্ক্রিনশট পাঠাতে হবে। যাচাই শেষে দ্রুত কোর্স অ্যাক্সেস দেওয়া হবে।'
  }
];

}
